{"owl": {"quest_complete": "The owl wolfs down the food you brought him, clicking his beak.", "description": "A large owl blinks at you intelligently.", "quest_item": "food", "dialogue": ["The owl squawks piteously, taps his stomach with one wing, and clicks his beak as if chewing.", "You feel a bit silly talking to an owl. He chirps in sympathy for your unease."], "reward": ["The owl squawks 'TREVOR!' and scuffs away some droppings to reveal a small-ish toad.", "trevor"], "name": "Owl"}, "neville": {"quest_complete": "Neville says, 'Thanks! I don't know how he keeps getting away...'", "description": "Neville Longbottom is pacing around.", "quest_item": "trevor", "dialogue": ["Neville says, 'I seem to have misplaced my toad. Can you find him?'", "Neville says, 'The Room of Requirement is stuck in sauna form, so the DA's meeting in the dungeons later.'", "Neville says,'Have we met? I'm Neville.'"], "reward": ["In his excitement over reuniting with Trevor, Neville has dropped a small piece of paper.", "scrap of paper"], "name": "Neville"}, "megan": {"quest_complete": "The presence of such a wondrous weapon as the Sword of Gryffindor wakes the Megan, who yanks the weapon out of your hands, brandishes it briefly, then drops back into a deep sleep.\n", "name": "Megan", "dialogue": ["The Megan twitches in sleep.", "The Megan remains asleep no matter how loudly you shout.", "The Megan flails an arm in the air and nearly takes your eye out."], "alive": true, "reward": ["Although you have no formal training with swords, you believe you might be able to imitate the Megan's movements to devastating effect.", "sword"], "quest_item": "sword", "description": "There is a Megan slumbering peacefully amid the squalor."}, "myrtle": {"dialogue": ["Myrtle says, 'You're just here to throw a book at me!'", "Myrtle says, 'Leave me alone!', and dives back into the toilet."], "name": "Myrtle", "alive": false, "description": "Myrtle is amusing herself by sobbing in between dives into the U-bend."}, "draco": {"house_specific": "Snake", "dialogue": ["Draco sneers, 'That Granger girl better watch her back.'", "Draco says, 'You should come to the dance on Saturday.'"], "out_house": ["Draco doesn't reply.", "Draco mumbles to himself as he tosses the snitch, '...Giant Squid...embarassingly uncreative...'"], "name": "Draco", "description": "Draco Malfoy lounges while tossing a snitch in the air."}, "mermaid": {"dialogue": ["The mermaid says something unintelligible that sounds like nails on a chalkboard.", "The mermaid says something that is clearly not friendly.", "The merm--hang on, why are you still here? She obviously wants to eat you, leave her alone!"], "name": "A Mermaid", "description": "Behind the glass is a mermaid, whose teeth are displayed in a fearsome grin."}}